results/tutorial_run1_20260727/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Script: phase1_meshing/generate_cmesh.py        |
|   \  /    A nd           | Time: 2026-07-25 12:41:20.648536                |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(-29.70000000 0.00000000 0.00000000) // 0
	(0.00000000 0.00000000 0.00000000) // 1
	(0.29640007 0.05899052 0.00000000) // 2
	(0.30000000 30.00000000 0.00000000) // 3
	(-29.70000000 0.00000000 0.01000000) // 4
	(0.00000000 0.00000000 0.01000000) // 5
	(0.29640007 0.05899052 0.01000000) // 6
	(0.30000000 30.00000000 0.01000000) // 7
	(0.30000000 -30.00000000 0.00000000) // 8
	(0.30347044 -0.05827600 0.00000000) // 9
	(0.30000000 -30.00000000 0.01000000) // 10
	(0.30347044 -0.05827600 0.01000000) // 11
	(0.99759200 0.00132350 0.00000000) // 12
	(0.99800000 30.00000000 0.00000000) // 13
	(0.99759200 0.00132350 0.01000000) // 14
	(0.99800000 30.00000000 0.01000000) // 15
	(0.99800000 -30.00000000 0.00000000) // 16
	(0.99759200 -0.00067650 0.00000000) // 17
	(0.99800000 -30.00000000 0.01000000) // 18
	(0.99759200 -0.00067650 0.01000000) // 19
	(30.99800000 0.00132350 0.00000000) // 20
	(30.99800000 30.00000000 0.00000000) // 21
	(30.99800000 0.00132350 0.01000000) // 22
	(30.99800000 30.00000000 0.01000000) // 23
	(30.99800000 -30.00000000 0.00000000) // 24
	(30.99800000 -0.00067650 0.00000000) // 25
	(30.99800000 -30.00000000 0.01000000) // 26
	(30.99800000 -0.00067650 0.01000000) // 27
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 106 120 1 ) simpleGrading ( 4.2337651416817996e-07 1 1 ) // 0 
	hex ( 0 8 9 1 4 10 11 5 )  ( 120 106 1 ) simpleGrading ( 1 4.2337651416817996e-07 1 ) // 1 
	hex ( 2 12 13 3 6 14 15 7 )  ( 89 106 1 ) edgeGrading ( 2.4003849374066086 2.4003849374066086 2.4003849374066086 2.4003849374066086 2361963.799443927 2361963.7994439327 2361963.7994439327 2361963.799443927 1 1 1 1 ) // 2 
	hex ( 9 8 16 17 11 10 18 19 )  ( 106 88 1 ) edgeGrading ( 2361963.799443927 2361963.7994439327 2361963.7994439327 2361963.799443927 2.3766187499075335 2.3766187499075335 2.3766187499075335 2.3766187499075335 1 1 1 1 ) // 3 
	hex ( 12 20 21 13 14 22 23 15 )  ( 60 106 1 ) simpleGrading ( 276.8014904921996 2361963.7994439327 1 ) // 4 
	hex ( 17 16 24 25 19 18 26 27 )  ( 106 60 1 ) simpleGrading ( 2361963.7994439327 276.8014904921996 1 ) // 5 
	hex ( 12 17 25 20 14 19 27 22 )  ( 10 60 1 ) simpleGrading ( 1 276.8014904921996 1 ) // 6 
);

edges
(
	arc 0 3 (-20.91320344 21.21320344 0.00000000) // arc 0 3 origin 1 (0.30000000 0.00000000 0.00000000)
...
	arc 4 7 (-20.91320344 21.21320344 0.01000000) // arc 4 7 origin 1 (0.30000000 0.00000000 0.01000000)
...
	arc 0 8 (-20.91320344 -21.21320344 0.00000000) // arc 0 8 origin 1 (0.30000000 0.00000000 0.00000000)
...
	arc 4 10 (-20.91320344 -21.21320344 0.01000000) // arc 4 10 origin 1 (0.30000000 0.00000000 0.01000000)
...
...
...
...
...
);

boundary
(
	symmetry1
	{
		type symmetry;
		faces
		(
			(17 16 24 25)
			(12 17 25 20)
			(2 12 13 3)
			(0 1 2 3)
			(9 8 16 17)
			(12 20 21 13)
			(0 8 9 1)
		);
	}

	symmetry2
	{
		type symmetry;
		faces
		(
			(6 14 15 7)
			(11 10 18 19)
			(14 22 23 15)
			(4 10 11 5)
			(14 19 27 22)
			(19 18 26 27)
			(4 5 6 7)
		);
	}

	wing
	{
		type wall;
		faces
		(
			(6 14 12 2)
			(5 11 9 1)
			(11 9 17 19)
			(5 1 2 6)
			(14 19 17 12)
		);
	}

	inout
	{
		type patch;
		faces
		(
			(7 15 13 3)
			(4 0 3 7)
			(4 10 8 0)
			(18 16 24 26)
			(27 26 24 25)
			(22 27 25 20)
			(15 23 21 13)
			(22 20 21 23)
			(10 8 16 18)
		);
	}

);

faces
(
);

mergePatchPairs
(
);

scale 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
